vlm/base/InformationRegisters/бит_МассаПроводаПоТипамТары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_МассаПроводаПоТипамТары</Name>
			<Comment>ЛТ5.30</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МассаНеттоКГ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДополнительныеПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_МатериалПровода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/бит_МассаПроводаПоТипамТары/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [14.11.2025 14:32:48] +        
	// Номенклатура Не обязательно если заполнены Размер и Материал, иначе нет.
	// Размер обязательно если не заполнена номенклатура
	// Материал обязательно если не заполнена номенклатура
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	вт.Номенклатура КАК Номенклатура,
	                      |	вт.Размер КАК Размер,
	                      |	вт.Материал КАК Материал
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	&вт КАК вт
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА вт.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                      |				ТОГДА ЛОЖЬ
	                      |			КОГДА вт.Материал <> ЗНАЧЕНИЕ(Перечисление.бит_МатериалПровода.ПустаяСсылка)
	                      |					И вт.Размер <> ЗНАЧЕНИЕ(Справочник.бит_ДополнительныеПризнакиНоменклатуры.ПустаяСсылка)
	                      |				ТОГДА ЛОЖЬ
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ) КАК Ошибка
	                      |ИЗ
	                      |	вт КАК вт");
	Запрос.УстановитьПараметр("вт", ЭтотОбъект.Выгрузить(, "Номенклатура, Размер, Материал"));
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Отказ = Результат.Ошибка;
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены обязательные поля");
	КонецЕсли;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [14.11.2025 14:32:48] -
КонецПроцедуры
